import jieba
import matplotlib.pyplot as plt
from wordcloud import WordCloud
from os import path
from PIL import Image
import numpy as np

final = ""
filename = r"2022.txt"

with open(filename, 'r', encoding='utf-8') as f:
    for line in f.readlines():
        temp = jieba.lcut(line)
        for i in temp:
            if len(i) >= 2:
                final = final + i + ' '

stop = ['自己', '我们', '某某', '这个', '他们', '比赛', '班级', '歌唱', '达到', '每个', '如果', '小王', '第六', '你们',
        '就是', '觉得', '还有', '所以', '到达', '这么', '应该', '没有', '不要', '一家', '不是', '最后', '需要', '已经',
        '什么', '因为', '的话', '几乎', '成为', '很多', '一句', '之前', '怎么', '但是', '并且', '为了', '一样', '真实',
        '当然', '任何', '开始', '地摊', '经济', '公交车', '这样', '概念', '狗肉', '不到', '各种', '附属', '为此',
        '进行', '正在', '只有', '宣讲会', '公交站', '朋友', '这是', '后备箱', '不能', '善于', '告诉', '方面', '许多',
        '南京', '数据', '电影', '有人', '一款', '健身', '综合', '看到', '知道', '做到', '有些', '视频', '深圳', '沈阳',
        '车型', '只要', '东西', '而且', '如此', '女人', '本田', '雪佛兰', '二姑', '肯定', '方式', '后来', '五菱',
        '比较', '中医', '医院', '不过', '或者', '一个', '沈阳', '医学院', '面试题', '公务员', '南门', '富昌隆', '一年',
        '特别', '北校区', 'mm', '步行', '普康', '这些', '举办', '作为', '可以', '同时', '回到', '治疗', '终于', '不会',
        '贵州省', '门口', '家中', '假如', '百花园', '回家', '有个', '分乘', '其实', '参加', '组织', '随即', '住址',
        '沈阳市', '先后', '汽车', '从家', '出租车', '到普康', '今年', '几个', '一直', '那些', '车内', '拿来', '天天',
        '那么', '两个', '当时', '真的', '乘坐', '当年', '别人', '土耳其', '读者', '禅院', '庙会', '还是', '西安',
        '三年', '今日', '可能', '一种', '结果', '光伏', '继续', '大福', '汽车', '通过', '做过', '可以', '尤其', '其他',
        '真正', '表示', '今天', '一条', '随着', '认为', '不少', '小小的', '一遍', '现在', '之后', '小哥', '这种',
        '义乌', '电池', '是否', '出来', '不同', '虽然', '摄影师', '不管', '找到', '一些', '一两年', '一下', '到谱康',
        '下午', '离开', '处理岐山', '工作人员', '名民法典', '内科', '谱康', '对此', '每天', '如下', '依然', '张庭',
        '介绍', '甚至', '第一次', '下去', '林瑞阳', '所有', '那个', '东北', '阿曼', '一起', '只是', '最终', '于杰',
        '辽宁人', '一点', '车辆', '如何', 'TST', '以及', '一次']

font = r'C:\Windows\fonts\Deng.ttf'
mask = np.array(Image.open('3.png'))
word_pic = WordCloud(
    collocations=False,
    font_path=font,
    height=1800,
    stopwords=stop,
    mask=mask,
    background_color='white',
    random_state=20,  # 设置有多少种随机生成状态，即有多少种配色方案
    width=1800,
    margin=2) \
    .generate(final)

plt.imshow(word_pic)
plt.axis("off")
plt.show()
word_pic.to_file('2022.png')
